---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.APIObject
source: html/69e1c59b-5627-8f46-6eec-bde2662b776a.htm
---
# APIObject Members

Causes the object to release immediately any resources it may be utilizing.